[{

                    "CIP-011-2": "Part 1.1"

    },

    {

                    "Applicable_Systems": "High Impact BES Cyber Systems and their associated: 1. EACMS; and 2. PACS, Medium Impact BES Cyber Systems and their associated: 1. EACMS; and 2. PACS"

    },

    {

                    "Requirements": "Method(s) to identify information that meets the definition of BES Cyber System Information."

    },

    {

                    "CIP-011-2": "Part 1.2"

    },

    {

                    "Applicable_Systems": "High Impact BES Cyber Systems and their associated: 1.EACMS; and 2.PACS Medium Impact BES Cyber Systems and their associated: 1.EACMS;and 2.PACS"

    }, {

                    "Requirements": "Procedure(s) for protecting and securely handling BES Cyber System Information, including storage, transit, and use."

    },

    {

                    "CIP-011-2": "Part 2.1"

    }, {

                    "Applicable_Systems": "Prior to the release for reuse of applicable Cyber Assets that contain BES Cyber System Information (except for reuse within other systems identified in the “Applicable Systems” column), the Responsible Entity shall take action to prevent the unauthorized retrieval of BES Cyber System Information from the Cyber Asset data storage media."

    }, {

                    "Requirements": "Prior to the release for reuse of applicable Cyber Assets that contain BES Cyber System Information (except for reuse within other systems identified in the “Applicable Systems” column), the Responsible Entity shall take action to prevent the unauthorized retrieval of BES Cyber System Information from the Cyber Asset data storage media."

    },

    {

                    "CIP-011-2": "Part 2.2"

    }, {

                    "Applicable_Systems": "High Impact BES Cyber Systems and their associated: 1. EACMS; 2. PACS; and 3. PCA Medium Impact BES Cyber Systems and their associated: 1. EACMS; 2. PACS; and 3. PCA"

    }, {

                    "Requirements": "Prior to the disposal of applicable Cyber Assets that contain BES Cyber System Information, the Responsible Entity shall take action to prevent the unauthorized retrieval of BES Cyber System Information from the Cyber Asset or destroy the data storage media."

    }

]