[
  {
    "Part": 1.1,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "Develop a baseline configuration, individually or by group, which shall include the following items:\n1.1.1.  Operating system(s) (including version) or firmware where no independent operating system exists;\n1.1.2.  Any commercially available or open-source application software (including version) intentionally installed;\n1.1.3.  Any custom software installed;\n1.1.4.  Any logical network accessible ports; and\n1.1.5.  Any security patches applied.",
    "Measures": "Examples of evidence may include, but are not limited to:\n?    A spreadsheet identifying the required items of the baseline configuration for each Cyber Asset, individually or by group; or\n?    A record in an asset management system that identifies the required items of the baseline configuration for each Cyber Asset, individually or by group."
  },
  {
    "Part": 1.2,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "Authorize and document changes that deviate from the existing baseline configuration.",
    "Measures": "Examples of evidence may include, but are not limited to:\n?    A change request record and associated electronic authorization (performed by the individual or group with the authority to authorize the change) in a change management system for each change; or\n?    Documentation that the change was performed in accordance with the requirement."
  },
  {
    "Part": 1.3,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "For a change that deviates from the existing baseline configuration, update the baseline configuration as necessary within 30 calendar days of completing the change.",
    "Measures": "An example of evidence may include, but is not limited to, updated baseline documentation with a date that is within 30 calendar days of the date of the completion of the change."
  },
  {
    "Part": 1.4,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "For a change that deviates from the existing baseline configuration:\n1.4.1.  Prior to the change, determine required cyber security controls in CIP-005 and CIP-007 that could be impacted by the change;\n1.4.2.  Following the change, verify that required cyber security controls determined in 1.4.1 are not adversely affected; and\n1.4.3.  Document the results of the verification.",
    "Measures": "An example of evidence may include, but is not limited to, a list of cyber security controls verified or tested along with the dated test results."
  },
  {
    "Part": 1.5,
    "Applicable Systems": "High Impact BES Cyber Systems",
    "Requirements": "Where technically feasible, for each change that deviates from the existing baseline configuration:\n1.5.1.  Prior to implementing any change in the production environment, test the changes in a test environment or test the changes in a production environment where the test is performed in a manner that minimizes adverse effects, that models the baseline configuration to ensure that required cyber security controls in CIP-005 and CIP-007 are not adversely affected; and\n1.5.2.  Document the results of the testing and, if a test environment was used, the differences between the test environment and the production environment, including a description of the measures used to account for any differences in operation between the test and production environments.",
    "Measures": "An example of evidence may include, but is not limited to, a list of cyber security controls tested along with successful test results and a list of differences between the production and test environments with descriptions of how any differences were accounted for, including of the date of the test."
  },
  {
    "Part": 2.1,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS; and\n2.   PCA",
    "Requirements": "Monitor at least once every 35 calendar days for changes to the baseline configuration (as described in Requirement R1, Part 1.1). Document and investigate detected unauthorized changes.",
    "Measures": "An example of evidence may include, but is not limited to, logs from a system that is monitoring the configuration along with records of investigation for any unauthorized changes that were detected."
  },
  {
    "Part": 3.1,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "At least once every 15 calendar months, conduct a paper or active vulnerability assessment.",
    "Measures": "At least once every 15 calendar months, conduct a paper or active vulnerability assessment."
  },
  {
    "Part": 3.2,
    "Applicable Systems": "High Impact BES Cyber Systems",
    "Requirements": "Where technically feasible, at least once every 36 calendar months:\n3.2.1   Perform an active vulnerability assessment in a test environment, or perform an active vulnerability assessment in a production environment where the test is performed in a manner that minimizes adverse effects, that models the baseline configuration of the BES Cyber System in a production environment; and\n3.2.2   Document the results of the testing and, if a test environment was used, the differences between the test environment and the production environment, including a description of the measures used to account for any differences in operation between the test and production environments.",
    "Measures": "Where technically feasible, at least once every 36 calendar months:\n3.2.1   Perform an active vulnerability assessment in a test environment, or perform an active vulnerability assessment in a production environment where the test is performed in a manner that minimizes adverse effects, that models the baseline configuration of the BES Cyber System in a production environment; and\n3.2.2   Document the results of the testing and, if a test environment was used, the differences between the test environment and the production environment, including a description of the measures used to account for any differences in operation between the test and production environments."
  },
  {
    "Part": 3.3,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PCA",
    "Requirements": "Prior to adding a new applicable Cyber Asset to a production environment, perform an active vulnerability assessment of the new Cyber Asset, except for CIP Exceptional Circumstances and like replacements of the same type of Cyber Asset with a baseline configuration that models an existing baseline configuration of the previous or other existing Cyber Asset.",
    "Measures": "Prior to adding a new applicable Cyber Asset to a production environment, perform an active vulnerability assessment of the new Cyber Asset, except for CIP Exceptional Circumstances and like replacements of the same type of Cyber Asset with a baseline configuration that models an existing baseline configuration of the previous or other existing Cyber Asset."
  },
  {
    "Part": 3.4,
    "Applicable Systems": "High Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA\nMedium Impact BES Cyber Systems and their associated:\n1.   EACMS;\n2.   PACS; and\n3.   PCA",
    "Requirements": "Document the results of the assessments conducted according to Parts 3.1, 3.2, and 3.3 and the action plan to remediate or mitigate vulnerabilities identified in the assessments including the planned date of completing the action plan and the execution status of any remediation or mitigation action items.",
    "Measures": "Document the results of the assessments conducted according to Parts 3.1, 3.2, and 3.3 and the action plan to remediate or mitigate vulnerabilities identified in the assessments including the planned date of completing the action plan and the execution status of any remediation or mitigation action items."
  },
  {
    "Part": 4,
    "Applicable Systems": "Each Responsible Entity, for its high impact and medium impact BES Cyber Systems and associated Protected Cyber Assets,shall implement, except under CIP Exceptional Circumstances, one or more documented plan(s) for Transient Cyber Assets and Removable Media that include the sections in Attachment 1. [Violation Risk Factor: Medium] [Time Horizon: Long-term Planning and Operations Planning]M4.  Evidence shall include each of the documented plan(s) for Transient Cyber Assets and Removable Media that collectively include each of the applicable sections in Attachment 1 and additional evidence to demonstrate implementation of plan(s) for Transient Cyber Assets and Removable Media. Additional examples of evidence per section are located in Attachment 2. If a Responsible Entity does not use Transient Cyber Asset(s) or Removable Media, examples of evidence include, but are not limited to, a statement, policy, or other document that states the Responsible Entity does not use Transient Cyber Asset(s) or Removable Media.",
    "Requirements": "",
    "Measures": ""
  }
]
