[
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R1",
   "Lanaguage": "Each Responsible Entity shall implement a process that considers each of the following assets for purposes of parts 1.1 through 1.3:i. Control Centers and backup Control Centers;ii. Transmission stations and substations;iii. Generation resources;iv. Systems and facilities critical to system restoration, including Blackstart Resources and Cranking Paths and initial switching requirements;v. Special Protection Systems that support the reliable operation of the Bulk Electric System; andvi. For Distribution Providers, Protection Systems specified in Applicability section 4.2.1 above.",
   "Applicability": "All BCS"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R1.1",
   "Lanaguage": "Identify each of the high impact BES Cyber Systems according to Attachment 1, Section 1, if any, at each asset;",
   "Applicability": "High BCS only"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R1.2",
   "Lanaguage": "Identify each of the medium impact BES Cyber Systems according to Attachment 1, Section 2, if any, at each asset; and",
   "Applicability": "Medium BCS only"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R1.3",
   "Lanaguage": "Identify each asset that contains a low impact BES Cyber System according to Attachment 1, Section 3, if any (a discrete list of low impact BES Cyber Systems is not required).",
   "Applicability": "Low BCS only"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R2",
   "Lanaguage": "The Responsible Entity shall:",
   "Applicability": "All BCS"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R2.1",
   "Lanaguage": "Review the identifications in Requirement R1 and its parts (and update them if there are changes identified) at least once every 15 calendar months, even if it has no identified items in Requirement R1, and",
   "Applicability": "All BCS"
 },
 {
   "Standard": "CIP-002-5.1",
   "Requirement": "R2.2",
   "Lanaguage": "Have its CIP Senior Manager or delegate approve the identifications required by Requirement R1 at least once every 15 calendar months, even if it has no identified items in Requirement R1.",
   "Applicability": "All BCS"
 }
]